Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoints Method
Overload List
Name | Description
PickPoints(Picker.PickPointEnum)
 Queries the user to pick points from the model.
PickPoints(Picker.PickPointEnum, String)
 Queries the user to pick points from the model with the given prompt and reference to another point.
Top
See Also
Reference
Picker Class
Tekla.Structures.Model.UI Namespace